АТДЛК/src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <attributes>
    <name>ЗаявкаКлиента</name>
    <type>
      <types>DocumentRef.ЗаявкаКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПеревозки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршрут</name>
    <attributes>
      <name>ЗаявкаНаПеревозку</name>
      <type>
        <types>DocumentRef.ЗаявкаНаПеревозку</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПогрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРазгрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальнаяТочка</name>
      <type>
        <types>CatalogRef.ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>КонечнаяТочка</name>
      <type>
        <types>CatalogRef.ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Перевозчик</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.ПеречислениеСтатусЗаявки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АТДЛК/src/Enums/ПеречислениеСтатусЗаявки/ПеречислениеСтатусЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПеречислениеСтатусЗаявки</name>
  <enumValues>
    <name>НаСогласование</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

АТДЛК/src/Documents/ЗаявкаНаПеревозку/ЗаявкаНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПеревозку</name>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ПеречислениеСтатусЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПогрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаРазгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Транспорт</types>
    </type>
  </attributes>
</mdclass:Document>

АТДЛК/src/Documents/МаршрутныйЛист/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура  ПеревозчикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.Маршрут.ТекущийЭлемент.Имя = "МаршрутПеревозчик" Тогда 
	
		CтандартнаяОбработка = Ложь;
		ДанныеМаршрута = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
		
		СтруктураМаршрута = Новый Структура("");	
		СтруктураМаршрута.Вставить("ДатаПогрузки", ДанныеМаршрута.ДатаПогрузки);
		СтруктураМаршрута.Вставить("ДатаРазгрузки", ДанныеМаршрута.ДатаРазгрузки);
		СтруктураМаршрута.Вставить("НачальнаяТочка", ДанныеМаршрута.НачальнаяТочка);
		СтруктураМаршрута.Вставить("КонечнаяТочка", ДанныеМаршрута.КонечнаяТочка);
		СтруктураМаршрута.Вставить("ЗаявкаНаПеревозку", ДанныеМаршрута.ЗаявкаНаПеревозку);
		
		Сообщить(СтруктураМаршрута.ДатаПогрузки);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияЗаявки", ЭтаФорма);
		ОткрытьФорму("Документ.ЗаявкаНаПеревозку.Форма.ФормаДокументаМаршрута", СтруктураМаршрута, , , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура  ПослеСозданияЗаявки(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда 
		ДанныеМаршрута = Элементы.Маршрут.ТекущиеДанные;
		ДанныеМаршрута.Перевозчик = Результат.Перевозчик;
		ДанныеМаршрута.Сумма = Результат.Сумма;
		ДанныеМаршрута.ЗаявкаНаПеревозку = Результат.ЗаявкаНаПеревозку;
		ДанныеМаршрута.Статус = Результат.Статус;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура МаршрутСтатусПриИзмененииНаСервере(ЗаявкаНаПеревозку)
	Если ЗаявкаНаПеревозку <> Документы.ЗаявкаНаПеревозку.ПустаяСсылка() Тогда
		Документ = ЗаявкаНаПеревозку.ПолучитьОбъект();
		Документ.Статус = Перечисления.ПеречислениеСтатусЗаявки.Отменена;
		Документ.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутСтатусПриИзменении(Элемент)
	
	ДанныеМаршрута = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;	
	Если ДанныеМаршрута.Статус = ПредопределенноеЗначение("Перечисление.ПеречислениеСтатусЗаявки.Отменена") Тогда 
		МаршрутСтатусПриИзмененииНаСервере(ДанныеМаршрута.ЗаявкаНаПеревозку);
	КонецЕсли;
	
КонецПроцедуры
